Autodesk.Revit.DB.TextNoteTypeSet
A set that contains textnote types.

Autodesk.Revit.DB.TextNoteTypeSet.Insert(Autodesk.Revit.DB.TextNoteType)
System.Int32
Insert the specified textnote type into the set.
item: The textnote type to be inserted into the set.
Returns: Returns whether the textnote type was inserted into the set.

Autodesk.Revit.DB.TextNoteTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.TextNoteTypeSet.ReverseIterator
Autodesk.Revit.DB.TextNoteTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.TextNoteTypeSet.ForwardIterator
Autodesk.Revit.DB.TextNoteTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.TextNoteTypeSet.Erase(Autodesk.Revit.DB.TextNoteType)
System.Int32
Removes a specified textnote type from the set.
item: The textnote type to be erased.
Returns: The number of textnote types that were erased from the set.

Autodesk.Revit.DB.TextNoteTypeSet.Contains(Autodesk.Revit.DB.TextNoteType)
System.Boolean
Tests for the existence of a textnote type within the set.
item: The textnote type to be searched for.
Returns: The Contains method returns True if the textnote type is within the set, otherwise False.

Autodesk.Revit.DB.TextNoteTypeSet.Clear
void
Removes every textnote type from the set, rendering it empty.

Autodesk.Revit.DB.TextNoteTypeSet.Size
System.Int32
get
Returns the number of textnote types that are in the set.

Autodesk.Revit.DB.TextNoteTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.